Public Attributes | List of all members
API_DimensionStandardsType Struct Reference
Project Navigator
Representation of the dimension preference. More...
#include <APIdefs_ViewSettings.hpp>
 Public Attributes
API_DimensionStandards_Head  | head
general information of the given dimension preference
API_DimensionPrefs  | dim
details of the given dimension preference
Detailed Description
Representation of the dimension preference.
Remarks
These settings correspond to the relevant items in the dimension preferences menu. Call the ACAPI_Navigator_DimStand_Search or the ACAPI_Navigator_DimStand_Get functions to operate on this data.
Member Data Documentation
◆ dim
 API_DimensionStandardsType::dim
details of the given dimension preference
◆ head
 API_DimensionStandardsType::head
general information of the given dimension preference